class CreateDB {
  String create() {
    return
      "CREATE TABLE IF NOT EXISTS \"أدعية منوعة\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create2() {
    return
      "CREATE TABLE IF NOT EXISTS \"ادعية الطواف\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create3() {
    return
      //-- Table: الحجر الأسود
      "CREATE TABLE IF NOT EXISTS \"الحجر الأسود\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create4() {
    return
      //-- Table: الصفا و المروة
      "CREATE TABLE IF NOT EXISTS \"الصفا و المروة\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create5() {
    return
      //-- Table: دعاء الإحرام
      "CREATE TABLE IF NOT EXISTS \"دعاء الإحرام\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create6() {
    return
      //-- Table: دعاء المسافر
      "CREATE TABLE IF NOT EXISTS \"دعاء المسافر\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create7() {
    return
      //-- Table: دعاء النظرة الاولى
      "CREATE TABLE IF NOT EXISTS \"دعاء النظرة الاولى\" (duaa TEXT, id NUMERIC PRIMARY KEY UNIQUE);"
    ;
  }

  String create8() {
    return
      //-- Table: دعاء دخول المسجد
      "CREATE TABLE IF NOT EXISTS \"دعاء دخول المسجد\" ( id	INTEGER , duaa	TEXT,PRIMARY KEY(id AUTOINCREMENT) );";
  }

  String create9() {
    return
      "CREATE TABLE IF NOT EXISTS \"مقام ابراهيم\" (id	INTEGER, duaa	TEXT, 	PRIMARY KEY(id AUTOINCREMENT));"
    ;
  }

  String insert() {
    return
      "INSERT INTO \'أدعية منوعة\' (duaa, id) VALUES ('ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار', 1);";
  }

  String insert_1() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('سبحان الله وبحمده، سبحان الله العظيم، لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير', 2);";
  }

  String insert_2() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم اغفر لي، وارحمني، اللهم إني أسألك رضاك والجنة، وأعوذ بك من سخطك والنار، اللهم أصلح قلبي وعملي، اللهم اغفر لي ولوالدي', 3);";
  }

  String insert_3() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم يا مقلب القلوب ثبِّت قلوبنا على دينك', 4);";
  }

  String insert_4() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم إني أسألك موجبات رحمتك وعزائم مغفرتك والسلامة من كل إثم والفوز بالجنة والنجاة من النار', 5);";
  }

  String insert_5() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم إني أسألك الهدى والغنى والعفاف اللهم أعني على ذكرك وشكرك وحسن عبادتك', 6);";
  }

  String insert_6() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم إني أسألك من الخير كله ما علمت منه وما لم أعلم وأعوذ بك من الشر كله ما علمت منه وما لم أعلم', 7);";
  }

  String insert_7() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم إني أسألك الجنة وما قرب منها من قول وعمل وأعوذ بك من النار وما قرب منها من قول أو عمل', 8);";
  }

  String insert_8() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول أبداً', 9);";
  }

  String insert_9() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللَّهُمَّ رَبَّنَا لكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ والأرْضِ، ولَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ والأرْضِ ومَن فِيهِنَّ، ولَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ والأرْضِ ومَن فِيهِنَّ، أنْتَ الحَقُّ، وقَوْلُكَ الحَقُّ، ووَعْدُكَ الحَقُّ، ولِقَاؤُكَ الحَقُّ، والجَنَّةُ حَقٌّ، والنَّارُ حَقٌّ، والسَّاعَةُ حَقٌّ، اللَّهُمَّ لكَ أسْلَمْتُ، وبِكَ آمَنْتُ، وعَلَيْكَ تَوَكَّلْتُ، وإلَيْكَ خَاصَمْتُ، وبِكَ حَاكَمْتُ، فَاغْفِرْ لي ما قَدَّمْتُ وما أخَّرْتُ، وأَسْرَرْتُ وأَعْلَنْتُ، وما أنْتَ أعْلَمُ به مِنِّي، لا إلَهَ إلَّا أنْتَ', 10);";
  }

  String insert_10() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('اللَّهُمَّ اغْفِرْ لي خَطِيئَتي وَجَهْلِي، وإسْرَافِي في أَمْرِي، وَما أَنْتَ أَعْلَمُ به مِنِّي، اللَّهُمَّ اغْفِرْ لي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذلكَ عِندِي، اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ علَى كُلِّ شيءٍ قَدِيرٌ', 11);";
  }

  String insert_11() {
    return "INSERT INTO \"أدعية منوعة\" (duaa, id) VALUES ('ربِّ اجعلْني لك شَكَّارًا لك ذَكَّارًا لك رهَّابًا لك مِطواعًا لك مُخبِتًا إليك أَوَّاهًا مُنيبًا ربِّ تقبَّلْ تَوْبتي واغسِلْ حَوبَتي وأَجِبْ دَعْوتي وثَبِّتْ حُجَّتي وسَدِّدْ لساني واهدِ قلبي واسلُلْ سَخيمةَ صدْري', 12);";
  }

  String insert2() {
    return
      "INSERT INTO \"دعاء المسافر\" (duaa, id) VALUES ('الله أكبر ،الله أكبر ،الله أكبر ', 1);";
  }

  String insert2_1() {
    return "INSERT INTO \"دعاء المسافر\" (duaa, id) VALUES ('سبحان الذي سخرلنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون', 2);";
  }

  String insert2_2() {
    return " INSERT INTO \"دعاء المسافر\" (duaa, id) VALUES ('اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى', 3);";
  }

  String insert2_3() {
    return "INSERT INTO \"دعاء المسافر\" (duaa, id) VALUES ('اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر وسوء المنقلب في المال والأهل', 4);"
    ;
  }


  String insert4() {
    return
      "INSERT INTO \"الصفا و المروة\" (duaa, id) VALUES ('إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيم', 1);";
  }

  String insert4_1() {
    return "INSERT INTO \"الصفا و المروة\" (duaa, id) VALUES ('الله أكبر, الله أكبر, الله أكبر', 2);";
  }

  String insert4_2() {
    return "INSERT INTO \"الصفا و المروة\" (duaa, id) VALUES ('لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا إله إلا الله وحده أنجز وعده، ونصر عبده، وهزم الأحزاب وحده', 3);"

    ;
  }

  String insert5() {
    return
      "INSERT INTO \"الحجر الأسود\" (duaa, id) VALUES ('الله أكبر', 1);";
  }

  String insert5_1() {
    return "INSERT INTO \"الحجر الأسود\" (duaa, id) VALUES ('للهم إيمانًا بك، وتصديقًا بكتابك، ووفاء بعهدك، واتباعًا لسنة نبيك محمد صلى الله عليه وسلم', 2);"

    ;
  }


  insert6() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ', 1);";
  }

  insert6_1() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ', 2);";
  }

  insert6_2() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ * رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ', 3);";
  }

  insert6_3() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('رَبَّنا آتِنا مِن لَدُنكَ رَحمَةً وَهَيِّئ لَنا مِن أَمرِنا رَشَدًا', 4);";
  }

  insert6_4() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ', 5);";
  }

  insert6_5() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('لَبَّيْكَ اللَّهُمَّ، لَبَّيْكَ، لَبَّيْكَ لا شَرِيكَ لكَ لَبَّيْكَ، إنَّ الحَمْدَ وَالنِّعْمَةَ لَكَ، وَالْمُلْكَ لا شَرِيكَ لكَ', 6);";
  }

  insert6_6() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('اللَّهمَّ اهدِني فيمن هديت، وعافِني فيمن عافيتَ، وتولَّني فيمن تولَّيتَ، وبارِك لي فيما أعطيتَ، وقني شرَّ ما قضيتَ، إنَّكَ تقضي ولا يقضى عليْكَ، وإنَّهُ لا يذلُّ من واليتَ، ولا يعزُّ من عاديتَ، تبارَكتَ ربَّنا وتعاليتَ', 7);";
  }

  insert6_7() {
    return "INSERT INTO \"ادعية الطواف\" (duaa, id) VALUES ('اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى', 8);"

    ;
  }

  String insert3() {
    return
      "INSERT INTO \"دعاء النظرة الاولى\" (duaa, id) VALUES ('اللَّهُمَّ زِدْ هَذَا البَيْتَ تَشْريفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مِن شَرَّفَهُ وكَرمَهُ مِمَّنْ حَجَّه أو اعْتَمَرَه تَشْرِيفًا وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا', 1);"
    ;
  }

  String insert7() {
    return "INSERT INTO \"دعاء الإحرام\" (duaa, id) VALUES ('لبيك اللهم عمرة', 1);"

    ;
  }


  String insert8() {
    return
      " INSERT INTO \"دعاء دخول المسجد\" VALUES (1,'إذا دخل أحدكم المسجد فليقل: اللهم افتح لي أبواب رحمتك، وإذا خرج فليقل: اللهم إني أسألك من فضلك');"
    ;
  }

  String insert9() {
    return
      " INSERT INTO \"مقام ابراهيم\" VALUES (1,'اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي إنه لا يغفر الذنوب إلا أنت');"
    ;
  }
}